###############################################################################
# Created by write_sdc
# Fri May  8 12:05:56 2026
###############################################################################
current_design picorv32_bp_top
###############################################################################
# Timing Constraints
###############################################################################
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0231 [get_ports {mem_instr}]
set_load -pin_load 0.0231 [get_ports {mem_valid}]
set_load -pin_load 0.0231 [get_ports {mem_addr[31]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[30]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[29]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[28]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[27]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[26]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[25]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[24]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[23]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[22]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[21]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[20]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[19]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[18]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[17]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[16]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[15]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[14]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[13]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[12]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[11]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[10]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[9]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[8]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[7]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[6]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[5]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[4]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[3]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[2]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[1]}]
set_load -pin_load 0.0231 [get_ports {mem_addr[0]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[31]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[30]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[29]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[28]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[27]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[26]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[25]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[24]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[23]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[22]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[21]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[20]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[19]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[18]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[17]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[16]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[15]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[14]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[13]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[12]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[11]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[10]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[9]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[8]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[7]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[6]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[5]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[4]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[3]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[2]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[1]}]
set_load -pin_load 0.0231 [get_ports {mem_wdata[0]}]
set_load -pin_load 0.0231 [get_ports {mem_wstrb[3]}]
set_load -pin_load 0.0231 [get_ports {mem_wstrb[2]}]
set_load -pin_load 0.0231 [get_ports {mem_wstrb[1]}]
set_load -pin_load 0.0231 [get_ports {mem_wstrb[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {resetn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_1 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[0]}]
###############################################################################
# Design Rules
###############################################################################
