###############################################################################
# Created by write_sdc
# Sun May  3 13:41:07 2026
###############################################################################
current_design picorv32_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
